#include <stdio.h>

int main(){
    int a =10;
    int * p =&a;

    //1. (*p)++: 현재 값을 반환하고 이후 값을 증가시킵니다.
    a=10;
    printf("(*p)++ 결과: %d, 연산 후 a의 값:", (*p)++);
    printf("%d\n",a);//a는 11이 됨

    //2.(*p)+1: 값을 변경하지 않고 1만큼 더한 결과를 반환합니다.
    a=10;
    printf("(*p)+1 결과 %d, 연산 후 a의 값:", (*p)+1);
    printf("%d\n",a); //a는 여전히 10 유지

    //3. *p += 1: 값을 1 증가시키고 결과를 다시 저장합니다.
    a=10;
    *p+=1;
    printf("*p += 1 결과 a의 값: %d\n",a); //a는 11이 됨
    
    //4. ++*p: 값을 먼저 1 증가시키고 증가됮 값을 반환합니다.
    a=10;
    printf("++*p 결과: %d,연산 후 a의 값:", ++*p);
    printf("%d\n",a); // a는 11이 됨

    return 0;

}